ГТС/УТГТС/ExchangePlans/МобильноеПриложениеЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>МобильноеПриложениеЗаказыКлиентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиPushУведомлений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиPushУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНастройкиОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.МобильноеПриложениеЗаказыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодписчикаДоставляемыхУведомлений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьAPNS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьGCM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСервераОтправителяGCM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинСервисаПередачиPushУведомлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>54</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриложенияGoogleCloud</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксДляДанныхМобильногоУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатМобильногоПриложенияIOS</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиРеквизитовОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыОтправкиPushУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОтправкиPushУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправлятьНепосредственно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправлятьЧерезВспомогательныйСервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/ExchangePlans/МобильноеПриложениеЗаказыКлиентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признак использования плана обмена для организации обмена в модели сервиса.
//  Если признак установлен, то в сервисе можно включить обмен данными
//  с использованием этого плана обмена.
//  Если признак не установлен, то план обмена будет использоваться только 
//  для обмена в локальном режиме работы конфигурации.
//
// Возвращаемое значение:
//  Булево - признак использования плана обмена для организации обмена в модели сервиса.
//
Функция ПланОбменаИспользуетсяВМоделиСервиса() Экспорт
	
	Возврат Ложь;
КонецФункции

// Возвращает признак использования Push-уведомлений.
//
// Возвращаемое значение:
//  Булево - Истина, когда используется отправка Push-уведомлений.
//
Функция ПланОбменаИспользуетОтправкуPushУведомлений() Экспорт
	
	ЭтотУзел = ПланыОбмена.МобильноеПриложениеЗаказыКлиентов.ЭтотУзел();
	Возврат НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотУзел, "ВариантОтправкиPushУведомлений") = Перечисления.ВариантыОтправкиPushУведомлений.НеОтправлять;
КонецФункции

// Возвращает массив элементов отбора, которые будут использоваться в шапке формы.
//
// Возвращаемое значение:
//  Массив - массив реквизитов шапки формы.
//
Функция РеквизитыШапкиФормы() Экспорт
	
	РеквизитыШапкиФормы = Новый Массив;
	РеквизитыШапкиФормы.Добавить("ЭквайринговыйТерминал");
	РеквизитыШапкиФормы.Добавить("СтатьяДДСЭквайринг");
	
	РеквизитыШапкиФормы.Добавить("Куратор");
	
	РеквизитыШапкиФормы.Добавить("ИспользоватьДоверенностиДляРегистрацииОплаты");
	РеквизитыШапкиФормы.Добавить("ИспользоватьПКОДляРегистрацииОплаты");
	РеквизитыШапкиФормы.Добавить("Касса");
	РеквизитыШапкиФормы.Добавить("СтатьяДДСНаличные");
	
	РеквизитыШапкиФормы.Добавить("ИспользоватьВесовыеХарактеристики");
	РеквизитыШапкиФормы.Добавить("ПередаватьИзображенияТоваров");
	
	РеквизитыШапкиФормы.Добавить("НеОтображатьОстатокПриПодборе");
	
	Возврат РеквизитыШапкиФормы;
КонецФункции

// Возвращает соответствия элементов отбора и используемых функциональных опций.
//
// Возвращаемое значение:
//  Массив - массив соответствий элементов отбора функциональным опциям.
//
Функция СоответствияЭлементовОтбораФункциональнымОпциям() Экспорт
	
	Соответствия = Новый Массив;
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьСегментыНоменклатуры", "СегментНоменклатуры");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьСегментыПартнеров", "СегментПартнеров");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьНесколькоОрганизаций", "Организация");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьНесколькоВидовЦен", "ВидЦены");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьНесколькоСкладов", "Склад");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьСоглашенияСКлиентами", "Соглашение");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьОплатуПлатежнымиКартами", "ЭквайринговыйТерминал");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьОплатуПлатежнымиКартами", "СтатьяДДСЭквайринг");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьДоверенностиНаПолучениеТМЦ", "ИспользоватьДоверенностиДляРегистрацииОплаты");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьНесколькоКасс", "Касса");
	Соответствия.Добавить(Зависимость);
	
	Зависимость = Новый Соответствие;
	Зависимость.Вставить("ИспользоватьЗаданияДляУправленияТорговымиПредставителями", "Куратор");
	Соответствия.Добавить(Зависимость);
	
	Возврат Соответствия;
КонецФункции

// Возвращает предопределенный узел плана обмена "Мобильное приложение "1С:Заказы".
//
// Возвращаемое значение:
//  ПланОбменаСсылка - предопределенный узел.
//
Функция ГлавныйУзелОбмена() Экспорт
	
	ГлавныйУзелОбмена = ПланыОбмена.МобильноеПриложениеЗаказыКлиентов.ЭтотУзел();
	
	Если Не ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГлавныйУзелОбмена, "Код")) Тогда
		ГлавныйУзелОбъект = ГлавныйУзелОбмена.ПолучитьОбъект();
		ГлавныйУзелОбъект.Код = "001";
		ГлавныйУзелОбъект.Наименование = НСтр("ru='Центральный'");
		ГлавныйУзелОбъект.Записать();
	КонецЕсли;
	Возврат ГлавныйУзелОбмена;
КонецФункции

#КонецОбласти

#КонецЕсли
